Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Calling the removeSubrange(_:) method instead is preferred.
ja: removeSubrange(_:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the insert(contentsOf:at:) method instead is preferred.
ja: insert(contentsOf:at:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the related sorted() method is equivalent to calling this method and passing the less-than operator (<) as the predicate.
ja: 関連したsorted()メソッドを呼び出すことは、このメソッドを呼び出して、より小さい演算子（<）を述部として渡すことと等しいです。

source: Calling this method may invalidate all saved indices of this collection.
ja: このメソッドを呼び出すことは、このコレクションの全ての保存されたインデックスを無効にします。

source: Calling this method may invalidate any existing indices for use with this collection.
ja: このメソッドを呼び出すことは、このコレクションで使うためのあらゆる既存のインデックスを無効にします。

source: Calling this property directly is discouraged.
ja: このプロパティを直接に呼び出すことは、推奨されません。

source: Calls the given closure on each element in the sequence in the same order as a for-in loop.
ja: 指定されたクロージャをそのシーケンスの各要素上でfor-inループと同じ順番で呼び出します。

source: Cast instances of the Objective-C id type to a specific Swift type.
ja: Objective-C idのインスタンスをSwift型にキャストします。

source: Check Availability
ja: 利用可能性を調べる

source: Checking for Containment
ja: 制約を調べる

source: Choose a New Name and Declaration
ja: 新しい名前と宣言を選択する

source: Clamping a Range
ja: 範囲を固定する

source: Class prefixes are optional in Swift.
ja: クラス接頭辞は、スウィフトでは随意です。

source: Clean Up Your Code
ja: あなたのコードを掃除する

source: Closed enumerations are useful for representing a finite set of states that you expect people to switch over using a switch statement.
ja: 完結列挙は、人々がスイッチ文を使って切り替えることをあなたが期待する、ある有限な一揃いの状態を表すのに役立ちます。

source: Closures you pass to APIs can be called synchronously (immediately) or asynchronously (sometime later).
ja: あなたがAPIに渡すクロージャは、同期的に（直ちに）または非同期的に（いつか後で）呼び出されることができます。

source: Coalescing Nil Values
ja: nil値の合体

source: Cocoa Design Patterns
ja: Cocoaデザインパターン

source: Collection Implementations
ja: コレクション実装

source: Collection Mutability
ja: コレクションの可変性

source: Collection Traversal
ja: コレクション横断

source: Collections
ja: さまざまなコレクション

source: Collections that conform to MutableCollection gain the ability to change the value of their elements.
ja: MutableCollectionに準拠するコレクションは、それらの要素の値を変更する能力を獲得します。

source: Combining Sets
ja: 集合を結合する

source: Command-click a Swift class name to see its generated header.
ja: スウィフトクラス名をコマンド-クリックして、その生成ヘッダを見てください。

source: Common protocol to which all actors conform.
ja: それへと全てのアクターが準拠する共通プロコル。

source: Comparing Buffers
ja: バッファの比較

source: Comparing Optional Values
ja: オプショナル値の比較

source: Comparing Ranges
ja: 範囲の比較

source: Comparing Ranges as Collections
ja: 範囲をコレクションとして比較する

source: Comparing Results
ja: 値を比較する

source: Comparing Sequences
ja: シーケンスを比較する

source: Comparing Sets
ja: 集合を比較する

source: Comparing Values
ja: 値の比較

source: Complex pointer types, such as id *, must be explicitly annotated using these annotations.
ja: 複雑なポインタ型、例えばid *などは、これら注釈を使って、明示的に注釈を付けられなければなりません。

source: Complexity: Amortized O(1) if the set does not wrap a bridged NSSet.
ja: 計算量：この集合がブリッジされたNSSetをラップしないならば、均してO(1)。

source: Complexity: O(1)
ja: 計算量：O(1)

source: Complexity: O(1) if Index conforms to RandomAccessIndex; O(n) otherwise.
ja: 計算量：IndexがRandomAccessIndexに準拠するならばO(1)；そうでないならばO(n)。

source: Complexity: O(1) if Self conforms to RandomAccessCollection; O(n) otherwise.
ja: 計算量：SelfがRandomAccessCollectionに準拠するならばO(1)；そうでないならばO(n)。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is equal to maxLength.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはmaxLengthに相当します。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the absolute value of distance.
ja: 計算量：もしコレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはdistanceの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から除外する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkは除外される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to remove.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは除去される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to select from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から選択する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the resulting distance.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは結果の隔たりです。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the specified number of elements.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは指定した要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the length of the collection.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnはコレクションの長さです。

source: Complexity: O(1) on average, over many calls to append(_:) on the same collection.
ja: 計算量：同じコレクション上でのappend(_:)への多くの呼び出しに対して、均してO(1)。

source: Complexity: O(1), except if the sequence also conforms to Collection.
ja: 計算量：O(1)、例外としてシーケンスが同様にCollectionに準拠する場合を除きます。

source: Complexity: O(1), with O(k) deferred to each iteration of the result, where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(1)、結果の各反復に対してO(k)延期されて、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(1).
ja: 計算量：O(1)。

source: Complexity: O(separator.count).
ja: 計算量：O(separator.count)。

source: Complexity: O(k), where k is the length of the result.
ja: 計算量：O(k)、ここでkは結果の長さです。

source: Complexity: O(k), where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(k)、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(k), where k is the specified number of elements.
ja: 計算量：O(k)、ここでkは指定された要素の数です。

source: Complexity: O(m + n), where m is the length of this sequence and n is the length of the result.
ja: 計算量：O(m + n)、ここでmはこのシーケンスの長さで、nは結果の長さです。

source: Complexity: O(m + n), where n is the length of this sequence and m is the length of the result.
ja: 計算量：O(m + n)、ここでnはこのシーケンスの長さで、mは結果の長さです。

source: Complexity: O(m), where m is the length of newElements.
ja: 計算量：O(m)、ここでmはnewElementsの長さです。

source: Complexity: O(m), where m is the length of the right-hand-side argument.
ja: 計算量：O(m)、ここでmは右手側の引数の長さです。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of other.
ja: 計算量：O(m)、ここでmはシーケンスの長さとotherの長さのより短い方です。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of possiblePrefix.
ja: 計算量：O(m)、ここでmはシーケスの長さとpossiblePrefixの長さのより短い方です。

source: Complexity: O(n + c), where n is self.count and c is the number of changes contained by the parameter.
ja: 計算量：O(n + c)、ここでnはself.countです、そしてcはパラメータによって含まれる変更の数です。

source: Complexity: O(n + m), where n is length of this collection and m is the length of newElements.
ja: 計算量：O(n + m)、ここでnは配列の長さです、そしてmはnewElementsの長さです。

source: Complexity: O(n log n), where n is the length of the collection.
ja: 計算量：O(n log n)、ここでnはコレクションの長さです。

source: Complexity: O(n log n), where n is the length of the sequence.
ja: 計算量：O(n log n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the length of the collection.
ja: 計算量：O(n)、ここでnはコレクションの長さです。

source: Complexity: O(n), where n is the length of the sequence.
ja: 計算量：O(n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the number of elements in the collection.
ja: 計算量：O(n)、ここでnはコレクションの中の要素数です。

source: Complexity: O(n), where n is the ratio between unfiltered and filtered collection counts.
ja: 計算量：O(n)、ここでnはコレクションのフィルタされないものとフィルタされたもの数の比率です。

source: Complexity: Worst case performance is O(n * m), where n is the count of this collection and m is other.count.
ja: 計算量：最悪の場合の性能は、O(n * m)です、ここでnはこのコレクションの総数です、そしてmはother.countです。

source: Conforming Types
ja: これらの型が準拠

source: Conforming to the MutableCollection Protocol
ja: MutableCollectionプロトコルに準拠する

source: Conforming to the Numeric Protocol
ja: Numericプロトコルに準拠する

source: Conforming to the RandomAccessCollection Protocol
ja: RandomAccessCollectionプロトコルに準拠する

source: Conforming to the RandomNumberGenerator Protocol
ja: RandomNumberGeneratorプロトコルに準拠する

source: Conforming to the RangeReplaceableCollection Protocol
ja: RangeReplaceableCollectionプロトコルに準拠する

source: Conforming to the Sequence Protocol
ja: Sequenceプロトコルに準拠する

source: Conforming to the SetAlgebra Protocol
ja: SetAlgebraプロトコルに準拠する

source: Conforming to the SignedNumeric Protocol
ja: SignedNumericプロトコルに準拠する

source: Conforms To
ja: 次に準拠

source: Conforms when Base conforms to BidirectionalCollection and Base.Index conforms to Hashable.
ja: BaseがBidirectionalCollectionに準拠するそしてBase.IndexがHashableに準拠する時に準拠します。

source: Conforms when Base conforms to Collection and Base.Index conforms to Hashable.
ja: BaseがCollectionに準拠するそしてBase.IndexがHashableに準拠する時に準拠します。

source: Conforms when Base conforms to LazySequenceProtocol.
ja: BaseがLazySequenceProtocolに準拠する時に準拠します。

source: Conforms when Base conforms to MutableCollection.
ja: BaseがMutableCollectionに準拠する時に準拠します。

source: Conforms when Base conforms to RangeReplaceableCollection.
ja: BaseがRangeReplaceableCollectionに準拠する時に準拠します。

source: Conforms when Bound conforms to Decodable.
ja: BoundがDecodableに準拠する時に準拠します。

source: Conforms when Bound conforms to Encodable.
ja: BoundがEncodableに準拠する時に準拠します。

source: Conforms when Bound conforms to Hashable.
ja: BoundがHashableに準拠する時に準拠します。

source: Conforms when Bound conforms to Strideable and Bound.Stride conforms to SignedInteger.
ja: BoundがStrideableに準拠するそしてBound.StrideがSignedIntegerに準拠する時に準拠します。

source: Conforms when Bound is Int.
ja: BoundがIntである時に準拠します。

source: Conforms when Element conforms to Decodable.
ja: ElementがDecodableに準拠している時に準拠します。

source: Conforms when Element conforms to Encodable.
ja: ElementがEncodableに準拠する時に準拠します。

source: Conforms when Element is UInt8.
ja: ElementがUInt8である場合に準拠します。

source: Conforms when Scalar is Float.
ja: ScalarがFloatである時に準拠します。

source: Conforms when Success conforms to Equatable and Failure conforms to Equatable.
ja: SuccessがEquatableに準拠するそしてFailureがEquatableに準拠する時に準拠します。

source: Conforms when Success conforms to Hashable and Failure conforms to Hashable.
ja: SuccessがHashableに準拠するそしてFailureがHashableに準拠する時に準拠します。

source: Conforms when Value conforms to MutableCollection.
ja: ValueがMutableCollectionに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Decodable.
ja: WrappedがDecodableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to DecodableWithConfiguration.
ja: WrappedがDecodableWithConfigurationに準拠している時に準拠します。

source: Conforms when Wrapped conforms to Encodable.
ja: WrappedがEncodableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to EncodableWithConfiguration.
ja: WrappedがEncodableWithConfigurationに準拠している時に準拠します。

source: Conforms when Wrapped conforms to Equatable.
ja: WrappedがEquatableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Gesture.
ja: WrappedがGestureに準拠する時に準拠します。

source: Conforms when Wrapped conforms to Hashable.
ja: WrappedがHashableに準拠する時に準拠します。

source: Conforms when Wrapped conforms to View.
ja: WrappedがViewに準拠する時に準拠します。

source: Consider an app that requires a user to log into an account.
ja: ユーザがアカウントにログインするように要求するアプリを考えください。

source: Contains a buffer object, and provides access to an instance of Header and contiguous storage for an arbitrary number of Element instances stored in that buffer.
ja: バッファオブジェクトを収容します、そしてHeaderのインスタンスへのアクセスおよびそのバッファに格納される随意の数のElementインスタンスの隣接保管を提供します。

source: Conversely, the comparison returns false if only one of the arguments is nil or if the two arguments wrap values that are not equal.
ja: 反対に、この比較がfalseを返すのは、引数のうち１つだけがnilであるか、２つの引数が等しくない値をラップする場合です。

source: Convert the Throwing Expression to a Result
ja: スローする式を結果へと変換する

source: Convert this executor value to the optimized form of borrowed executor references.
ja: このエグゼキュータ値を、最適化された形式の借用エグセキュータ参照へと変換します。。

source: Converting Ranges
ja: 範囲を変換する

source: Converting a Result to a Throwing Expression
ja: 結果をスローする式へ変換する

source: Converting a Throwing Expression to a Result
ja: スローする式を結果へ変換する

source: Converts a typed UnsafeMutablePointer to an opaque C pointer.
ja: 型付けされたUnsafeMutablePointerを不透明Cポインタへと変換します。

source: Converts a typed UnsafePointer to an opaque C pointer.
ja: 型付けされたUnsafePointerを不透明Cポインタへと変換します。

source: Copying an iterator is safe, but advancing one copy of an iterator by calling its next() method may invalidate other copies of that iterator.
ja: あるイテレータをコピーすることは安全です、しかしあるインスタンスの１つのコピーをそれのメソッドnext()メソッドを呼び出すことによって前に進めることは、そのイテレータの他のコピーを無価値にするでしょう。

source: Create a Swift class for your corresponding Objective-C .m and .h files by choosing File > New > File > (iOS, watchOS, tvOS, or macOS) > Source > Swift File.
ja: あるSwiftクラスをあなたの対応するObjective-C .m と .h ファイルに対して、「File > New > File > (iOS、watchOS、tvOS、またはmacOS) > Source > Swift File」を選択することによって作成してください。

source: Create a new instance of the most-derived class, calling factory on the partially-constructed object to generate an initial Header.
ja: 最も派生したクラスの新しいインスンタスを作成します、部分的に組み立てられたオブジェクト上でfactoryを呼び出して初期Valueを生成します。

source: Create a new range using the half-open range operator (..<).
ja: 新しい範囲を半開範囲演算子（..<）を使って作成します。

source: Create with new storage containing an initial Header and space for at least minimumCapacity elements.
ja: ある初期Headerと少なくともminimumCapacity elementに対する空間を格納している新しいストレージを使って作成します。

source: Creates a 64-bit integer from another integer wrapped in a data value.
ja: ある64ビット整数をデータ値の中にラップされる別の整数から作成します。

source: Creates a collection containing the specified number of the given element.
ja: 指定された数の与えられた要素を含んでいるコレクションを作成します。

source: Creates a mirror representing the given subject using a dictionary literal for the structure.
ja: 与えられた主題を表すミラーを、その構造体のための辞書リテラルを使って作成します。

source: Creates a mirror representing the given subject with a specified structure.
ja: 与えられた主題を表すミラーを指定の構造体で作成します。

source: Creates a mirror representing the given subject with unlabeled children.
ja: 与えられた主題を表すミラーを幾つかのラベルを付けられない子で作成します。

source: Creates a mirror that reflects on the given instance.
ja: 与えられたインスタンスを反映するミラーを作成します。

source: Creates a new KeyValuePairs instance from the given dictionary literal.
ja: KeyValuePairsインスタンスを与えられた辞書リテラルから作成します。

source: Creates a new collection by concatenating the elements of a collection and a sequence.
ja: あるコレクションとあるシーケンスの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of a sequence and a collection.
ja: あるシーケンスとあるコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of two collections.
ja: ２つのコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection containing the specified number of a single, repeated value.
ja: 指定された数の、ある単一の値の繰り返しを含んでいる新しいコレクションを作成します。

source: Creates a new index into a reversed collection for the position before the specified index.
ja: 逆にされたコレクションへのある新しいインデックスを、指定されたインデックスの前の位置に対して、作成します。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Bool.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがBoolである場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Double.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがDoubleである場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Float.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがFloatである場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Int16.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがInt16である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Int32.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがInt32である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Int64.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがInt64である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Int8.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがInt8である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is Int.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがIntである場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is String.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがStringである場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt16.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUInt16である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt32.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUInt32である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt64.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUInt64である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt8.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUInt8である場合。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUIntである場合。

source: Creates a new instance by decoding from the given decoder.
ja: 与えられたデコーダからデコードすることで新しいインスタンスを作成します。

source: Creates a new instance from the bit pattern of the given instance by truncating or sign-extending if needed to fit this type.
ja: もしこの型に適合するのに必要ならば切り詰めるか符号拡張によって、指定インスタンスのビットパターンから新しいインスタンスを作成します。

source: Creates a new instance from the given integer, if it can be represented exactly.
ja: 与えられた整数から新しいインスタンスを作成します、もしそれが正確に表現できるならば。

source: Creates a new instance from the given integer.
ja: 与えられた整数から新しいインスタンスを作成します。

source: Creates a new instance of a collection containing the elements of a sequence.
ja: あるシーケンスの要素を含んでいるあるコレクションの新しいインスタンスを作成します。

source: Creates a new instance with the given container.
ja: 与えられたコンテナで新しいインスタンスを作成します。

source: Creates a new instance with the representable value that’s closest to the given integer.
ja: 与えられた整数に最も近い表現可能な値を使って新しいインスタンスを作成します。

source: Creates a new instance with the same memory representation as the given value.
ja: 与えられた値と同じメモリ表現で新しいインスタンスを作成します。

source: Creates a new instance with the specified raw value.
ja: 指定された生の値を持つ新しいインスタンスを作成します。

source: Creates a new integer value from the given string and radix.
ja: 与えられた文字列と基数から新しい整数値を作成します。

source: Creates a new integer value from the given string.
ja: 与えられた文字列から新しい整数値を作成します。

source: Creates a new option set from the given raw value.
ja: 与えられた生の値から新しいオプションセットを作成します。

source: Creates a new result by evaluating a throwing closure, capturing the returned value as a success, or any thrown error as a failure.
ja: 新しい結果を、あるスローするクロージャを評価することによって作成します、返される値をある成功としてキャプチャしています、または何からのスローされたエラーをある失敗として。

source: Creates a new set by decoding from the given decoder.
ja: 与えられたデコーダからデコードすることで新しい集合を作成します。

source: Creates a new set from a finite sequence of items.
ja: いくつかの要素からなる有限のシーケンスから集合を作成します。

source: Creates a new value equal to zero.
ja: ゼロに等しい新しい値を作成します。

source: Creates a new vector by decoding scalars from the given decoder.
ja: ある新しいベクターをこの与えられたデコーダからスカラーをデコードすることによって作成します。

source: Creates a new vector from the given elements.
ja: ある新しいベクターをこの与えられた要素それらから作成します。

source: Creates a new vector from the given vector of floating-point values.
ja: ある新しいベクターをこの与えられた浮動小数点値のベクターから作成します。

source: Creates a new vector from the given vector of integers.
ja: ある新しいベクターを整数からなるこの与えられたベクターから作成します。

source: Creates a new vector from the given vector, clamping the values of the given vector’s elements if necessary.
ja: ある新しいベクターをこの与えられたベクターから作成します、与えられたベクターのもつ要素の値を必要に応じてクランプします。

source: Creates a new vector from the given vector, rounding the given vector’s of elements using the specified rounding rule.
ja: ある新しいベクターをこの与えられたベクターから作成します、与えられたベクターのもつ要素を指定された丸め規則を使って丸めます。

source: Creates a new vector from the given vector, truncating the bit patterns of the given vector’s elements if necessary.
ja: ある新しいベクターをこの与えられたベクターから作成します、与えられたベクターのもつ要素のビットパターンを必要に応じて切り詰めます。

source: Creates a new vector from two half-length vectors.
ja: ある新しいベクターは２つの半分長のベクターから作成します。

source: Creates a new, empty collection.
ja: 新しい、空のコレクションを作成します。

source: Creates a publisher that delivers the specified output and finishes normally.
ja: 指定された出力を配達して通常に終了するパブリッシャーを作成します。

source: Creates a publisher that delivers the specified result.
ja: 指定された結果を配達するあるパブリッシャーを作成します。

source: Creates a publisher that immediately terminates upon subscription with the given failure.
ja: この与えられた失敗で定期購読上で直ぐに終了するパブリッシャーを作成します。

source: Creates a publisher to emit the value of the optional, or to finish immediately if the optional doesn’t have a value.
ja: あるパブリッシャーを作成してオプショナルの値を発布します、またはそのオプショナルが値を持たないならば直ちに終了します。

source: Creates a sequence that presents the elements of base sequences concatenated using separator.
ja: あるシーケンス、それはbaseシーケンスたちの要素を、与えられたseparatorを使って連結して提示します。

source: Creates a set containing the elements of the given array literal.
ja: 与えられた配列リテラルの要素を含んでいる集合を作成します。

source: Creates a vector from the given sequence.
ja: あるベクターをこの与えられたシーケンスから作成します。

source: Creates a vector from the specified elements.
ja: あるベクターをこの指定された要素それらから作成します。

source: Creates a vector with zero in all lanes.
ja: あるベクターを全レーンにおいてゼロで作成します

source: Creates an OpaquePointer from a given address in memory.
ja: メモリ中の与えられたアドレスからOpaquePointerを作成します。

source: Creates an empty option set.
ja: 空のオプションセットを作成します。

source: Creates an empty set with preallocated space for at least the specified number of elements.
ja: 空の集合を、あらかじめアロケートされたスペースで少なくとも指定された要素数に対して作成します。

source: Creates an empty set.
ja: 空の集合を作成します。

source: Creates an instance equivalent to the given ClosedRange.
ja: 与えられたClosedRangeと等しいインスタンスを作成します。

source: Creates an instance initialized to the specified integer value.
ja: 指定された整数値に初期化されるインスタンスを作成します。

source: Creates an instance initialized with nil.
ja: nilで初期化されるインスタンスを作成します。

source: Creates an instance that stores the given value.
ja: 与えられた値を格納するインスタンスを作成します。

source: Creates an instance that uniquely identifies the given class instance.
ja: 与えられたクラスインスタンスを固有に識別するインスタンスを作成します。

source: Creates an instance that uniquely identifies the given metatype.
ja: 与えられたメタタイプを固有に識別するインスタンスを作成します。

source: Creates an instance whose iterator is a copy of base.
ja: それのイテレータがbaseのコピーであるインスタンスを作成します。

source: Creates an instance with the given bounds.
ja: 与えられた境界を使ってインスタンスを作成します。

source: Creates an integer from its big-endian representation, changing the byte order if necessary.
ja: それのビッグエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from its little-endian representation, changing the byte order if necessary.
ja: それのリトルエンディアン表現から整数を作成します、必要ならばバイト順を変更します。

source: Creates an integer from the given floating-point value, if it can be represented exactly.
ja: 与えられた浮動小数点値から整数を作成します、もしそれが正確に表現可能ならば。
